from django.shortcuts import render
from django.http import HttpResponse
# Create your views here.

def home(request):
    context = {
        "articles" : [
    {
            "title" : "پست اول",
            "description" :"سید محمدحسین بهجت تبریزی متخلص به شهریار شاعر ایرانی اهل آذربایجان بود که به زبان‌های ترکی آذربایجانی و فارسی شعر سروده است. وی در تبریز به‌دنیا آمد و بنا به وصیتش در مقبرة الشعرای همین شهر به خاک سپرده شد. ۲۷ شهریور، روز درگذشت وی را «روز شعر و ادب فارسی» نامگذاری کرده‌اند.",
            "img" :"https://golbama.com/uploads/thumbs/%DA%AF%D9%84-%D8%B1%D8%B2-%D9%87%D9%84%D9%86%D8%AF%DB%8C-800.png"
    },
    {
            "title" : "اولین پست",
            "description" : "سید محمدحسین بهجت تبریزی متخلص به شهریار شاعر ایرانی اهل آذربایجان بود که به زبان‌های ترکی آذربایجانی و فارسی شعر سروده است. وی در تبریز به‌دنیا آمد و بنا به وصیتش در مقبرة الشعرای همین شهر به خاک سپرده شد. ۲۷ شهریور، روز درگذشت وی را «روز شعر و ادب فارسی» نامگذاری کرده‌اند.",
            "img" : "https://golbama.com/uploads/thumbs/%DA%AF%D9%84-%D8%B1%D8%B2-%D9%87%D9%84%D9%86%D8%AF%DB%8C-800.png"

    },
    {
            "title" : "اولین پست",
            "description" : "سید محمدحسین بهجت تبریزی متخلص به شهریار شاعر ایرانی اهل آذربایجان بود که به زبان‌های ترکی آذربایجانی و فارسی شعر سروده است. وی در تبریز به‌دنیا آمد و بنا به وصیتش در مقبرة الشعرای همین شهر به خاک سپرده شد. ۲۷ شهریور، روز درگذشت وی را «روز شعر و ادب فارسی» نامگذاری کرده‌اند.",
            "img" : "https://golbama.com/uploads/thumbs/%DA%AF%D9%84-%D8%B1%D8%B2-%D9%87%D9%84%D9%86%D8%AF%DB%8C-800.png"
    },
]
}
    return render(request,"blog\\home.html",context)